# # # # # # #!/usr/bin/env python
# # # # # # # -*- coding: utf-8 -*-
# # # # # # # @Time    : 11:31
# # # # # # # @Author  : Carewn
# # # # # # # @Software: PyCharm
# # # # #
# # # # # import requests
# # # # #
# # # # # geturl = 'https://kyfw.12306.cn/otn/confirmPassenger/getPassengerDTOs'
# # # # # url = 'https://kyfw.12306.cn/otn/leftTicket/query?leftTicketDTO.train_date=2018-09-27&leftTicketDTO.from_station=SZQ&leftTicketDTO.to_station=WHN&purpose_codes=ADULT'
# # # # # r = requests.get(url)
# # # # # print (r.cookies)
# # # # # for i in r.json()['data']['result']:
# # # # #     s = i.split('|')
# # # # #     if s[0] and s[1] == '预订':
# # # # #         if s[30] == '有':
# # # # #             pass
# # # # #             # data = {
# # # # #             #     '_json_att':'',
# # # # #             #     'REPEAT_SUBMIT_TOKEN':'b551a9690b8c82e25fae7d3e0640098e'
# # # # #             # }
# # # # #             # r = requests.post(geturl,data=data)
# # # # #             # print (r.json())
# # # # # #             # break
# # # # # a = []
# # # # # if a.__len__() == 0:
# # # # #     print (1)
# # # # # else:
# # # # # #     print (2)
# # # # # a = ['a',2,2,2,2,2,2,3,3,3,3,3,3,3,3,3,3,3,None,3,3,3]
# # # # # print(all(a))
# # # # # if a:
# # # # #     print (1)
# # # # # else:
# # # # #     print(2)
# # # # # #
# # # # #
# # # # #
# # # # #
# # # # # print(chr(0x81))
# # # # #
#
# import pandas as pd
# import numpy as np
# from pandas import DataFrame
#
# data = pd.read_excel('./xcx.xls')
# print(data)
#
# data1 = list(data['小程序名称'].values)
#
# data2 = list(data['成功的程序'].values)
# s = []
# for i in data1:
#     if i in data2:
#         i = str(i)+'after'
#         s.append(i)
#     else:
#         s.append(i)
#
# # print('*' * 100)
# # print(failed)
# # data2 = [d for d in data2 if d != tmp]
# # print(data2)
# # data3 = [i for i in data1 if i not in data2]
# # print(len(data3), len(data1), len(data2))
# # print(data3)
# df = DataFrame(columns=['a'], data=s)
# data['成功的记录'] = df['a']
# print(data)
# data.to_excel('result.xls')
# # #
# # # a = 'https://mp.ydm01.cn/api/wx_center/wx_third/wx_mini_list'
# # # d = {'pageNumber': 1, 'pageSize': 300, 'auditstatus': 0}
# # # import requests
# # # a = requests.post(a,d)
# # # print (a.text)
# #
# #
# #
# # # import unittest
# # # class UnittestTest(unittest.TestCase):
# # #
# # #     def setUp(self):
# # #         pass
# # #
# # #     def tearDown(self):
# # #         pass
# # #
# # #     def test_str(self):
# # #         a = 5
# # #         b = 6
# # #         # with self.assertWarns(self.assertEqual(a , b)) as cm:
# # #         #     print (b)
# # #         # the_exception = cm.expected
# # #         # print ('-----------------',the_exception)
# # #         # self.assertEqual(the_exception.error_code,3)
# # #         print (self.id())
# # #
# # # if __name__ =="__main__":
# # # #     unittest.main()
# # # a = 7 and 3 or 4
# # # print (a)
# #
#
# # import numpy as np
# # import pandas as pd
# # s = []
# # ass = []
# # data = pd.read_excel('./xcx.xls',sheet_name='inter')
# # intername = list(data['interface_name'].values)
# # arg = list(data['arg'].values)
# # asserts = list(data['asserts'].values)
# # for i,q,a in zip(intername,arg,asserts):
# #     if i == 'login':
# #         s.append(q)
# #         ass.append(a)
# #
# #
# #
# # def cl(lists,asserts):
# #     def lu(func):
# #         def xunhuan(*args, **kwargs):
# #             print ('hhhhh')
# #             for i,q in zip(lists,asserts):
# #                 func(i,q)
# #             return func(*args, **kwargs)
# #         return xunhuan
# #     return lu
# #
# #
# # @cl(s,ass)#s是一个列表
# # def login(data,asserts):
# #     import requests
# #     r = requests.post('https://saas.ydm01.cn/api/admin/ManagerStorePWDLogin',data)
# #     assert r.json()['msg'] == asserts
# #     print ('----------OK--------------')
# #
# # data = {'account':'13530852030','pwd':'e10adc3949ba59abbe56e057f20f883e'}
# # assertss = '参数错误'
# # login(data,assertss)
# #
#
# #
# #
# #
# # # xcx = pd.read_excel('./xcx.xls')
# # # print (xcx)
# #
#
# # def logging(level):
# #     def wrapper(func):
# #         def inner_wrapper(*args, **kwargs):
# #             print ("[{level}]: enter function {func}()".format(
# #                 level=level,
# #                 func=func.__name__))
# #             return func(*args, **kwargs)
# #         return inner_wrapper
# #     return wrapper
# #
# # @logging(level='INFO')
# # def say(something):
# #     print ("say {}!".format(something))
# #
# # # 如果没有使用@语法，等同于
# # # say = logging(level='INFO')(say)
# #
# # @logging(level='DEBUG')
# # def do(something):
# #     print ("do {}...".format(something))
# #
# # if __name__ == '__main__':
# #     say('hello')
# #     do("my work")
#
#
#
# import requests
# data = {'account':'13530852030','pwd':'e10adc3949ba59abbe56e057f20f883e'}
# r = requests.post('https://saas.ydm01.cn/api/admin/ManagerStorePWDLogin',data)
# token = r.json()['token']
# print (token)
#
# headers = {'Authorization':'Bearer' + '' + token}
# files = {
#     "file":('员工排班管理-测试购买-2019-03.xlsx',open('E:/员工排班管理-测试购买-2019-03.xlsx','rb'),'application/vnd.openxmlformats-officedocument.spreadsheetml.sheet')
# }
# r = requests.post('https://saas.ydm01.cn/api/team/classImport',files=files,headers=headers)
#
# print(r.json())
#
# # with open('E:/员工排班管理-测试购买-2019-03.xlsx','rb') as fp:
# #     data = fp.read()
# # print (data)
# # post = {'file':data}
# # r = requests.post(url='https://saas.ydm01.cn/api/team/classImport',data=post)
# # print (r.text)

#-----------------------------',time.strftime('%y%m%d%H%M%S',time.localtime(time.time())))


#
# def person(a,b,c,*d,**e):
#     print ('a:',a,'b:',b,'c:',c,'d:',d,'e:',e)
#
# aaa = {'d':1,'e':2,'r':3}
# bbb = (1,2,3,4,5,6,7,8)
# ccc = [11,22,33,44,55,66,77]
# person(*ccc,**aaa)

#
# def sum(*a):
#     x = 1
#     for i in range(a.__len__()):
#         x = x * a[i]
#     return x
# ss = [3,5,6,9,8,7,5,6]
# sum(1,2,3,4,5,6,7,8,9)
# #
# # a = lambda *a: for i in range(len(a))
# L1 = ['Hello', 'World', 18, 'Apple', None]
# l2 = [i.lower() for i in L1 if isinstance(i,str)]
# print (l2)


# a = 3*5*6*9*8*7*5*6
# print (a)

# def fack(n):
#     if n == 1:
#         return 1
#     return n* fack(n-1)
# print (fack(800))


# def fack(n):
#     return fack_file(n,1)
#
# def fack_file(mum,pro):
#     if mum == 1:
#         return pro
#     return fack_file(mum - 1,mum * pro)
# print (fack(10))
# import string
# def trim(s):
#     n = []
#     for i in range(s.__len__()):
#         if s[i].isspace():
#             continue
#         else:
#             n.append(i)
#     s = s[n[0]:n[-1] + 1]
#
# def trim(s):
#     n = [i for i in range(s.__len__()) if s[i].isspace() == False]
#     # for i in range(s.__len__()):
#     #     if s[i].isspace():
#     #         continue
#     #     else:
#     #         n.append(i)
#     s = s[n[0]:n[-1] + 1]
#     print (s)
# trim('   hhh  hhh  hh hh h h    ')

# str.strip()
#
#
#
# print (trim('   hh  ss hh aa hh   '))
#

# s = '     hhhh hh kk hhh lll   '
# s = s.strip()
# print (s)
# from collections import Iterable
# # a = [1,2,5,7,-20,2,3,4,5,6,7,8,90,8,7,6,45,5,3,5,345,34,5,345,34,5,34,5,35,3,45,3,996]
# # # def x(a):
# # #     if isinstance(a,Iterable):
# # #         p = a[0]
# # #         s = a[0]
# # #         for i in a:
# # #             p = i if p > i else p
# # #             s = i if s < i else s
# # #         l = (p,s)
# # #     print (l)
# # # x(a)
# #
# # def sss(a):
# #     print(min(a),max(a))
# # sss(a)
# # a = [x * x for x in range(1,11) if x > 3]
# # # print (a)
# #
# # a = ['a,','b','c','d','e','f']
# # b = [1,2,3,4,5,6]
# # f = [x+str(y) for x in a for y in b]
# # print (len(f))
#
#
#
# # def fib(max):
# #     n,a,b = 0,0,1
# #     while n < max:
# #         yield b
# #         a , b = b , a + b
# #         n = n + 1
# #     return 'done'
# #
# # print (fib(6))
# #
# # def ild():
# #     print (1)
# #     yield
# #     print (2)
# #     yield
# #     print(3)
# #     yield
# #     print(4)
#
#
# # def odd():
# #     print('step 1')
# #     yield 1
# #     print('step 2')
# #     yield(3)
# #     print('step 3')
# #     yield(5)
# #     return 'done'
# #
# # try:
# #     for i in odd():
# #         print (i)
# # except StopIteration as e:
# #     print (e.value)
# # def x():
# #     L = [1]
# #     while len(L)<10:
# #         yield L
# #         L = [1] + [L[i] + L[i + 1] for i in range(len(L)-1)]+ [1]
# #         print (L)
# #
# # a = x()
# # for i in a:
# #     print (i)
# # L = [1,3,3,1]
# # L = [1] + [L[i] + L[i + 1] for i in range(3)]+ [1]
# # print (L)
# #
# #
# # def ar(*a):
# #     for i in a:
# #         if type(i) == int:
# #             return True
# #         else:
# #             return False
# #
# # a = [1,2,3,'a','b',5,'c','h']
# # print (list(filter(ar,a)))
#
# # def x():
# #     x = 0
# #     while True:
# #         x = x + 1
# #         yield x
# # print (list(x()))
# #
# #
# # def yy():
# #     return lambda x:x
# #
# # def x(y):
# #     y = str(y)
# #     p = ''
# #     s = ''
# #     for i in range(len(y)):
# #         p = p + y[i]
# #         s = s + y[-i-1]
# #     if p == s and len(y) >= 2:
# #         return y
# # def a():
# #     return list(filter(x,range(1,10000)))
# #
# # print (a())
# # a = [1,2,3]
# # b = [3,2,1]
# # print (a == b)
#
#
# # def fun(x):
# #     y = ''
# #     lens = len(x) #传入数组数量
# #     while lens != 0:#循环结束条件
# #         lens = lens - 1
# #         y = y + str(max(x))#字符串凭接最大数
# #         x.remove(max(x))
# #     return str(y)
# #
# # print (fun([1,30,5,2,6,9,8,22,55,0]))
#
#
#
#
# # L = [('Bob', 75), ('Adam', 92), ('Bart', 66), ('Lisa', 88)]
# # def lists(i):
# #     return i[1]
# # s = sorted(L,key=lists,reverse=True)
# # print(s)
# #
# # def x(a):
# #     s = a
# #     return s
# # def y(i):
# #     return i * i
# #
# # print(x(y(3)))
# # def lazy_sum(*args):
# #     def sums():
# #         sum1 = 0
# #         for i in args:
# #             sum1 = sum1 + i
# #         return sum1
# #     return sums
# #
# # f1 = lazy_sum(1,2,3,4,5,6,7)
# # f2 = lazy_sum(1,2,3,4,5,6,7)
# # print (f1 == f2)
# #
# #
# # # False
# # a = [['环亚美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['诺研皮肤管理', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如胸部整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['芳妍美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['绿苑女子', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如鼻部整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['伊之花美容', '审核成功', ''], ['七号驻颜', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['曼奇莎', '审核成功', ''], ['诗美逸', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['赫阁尔', '审核成功', ''], ['草木缘', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['漂亮宝贝', '审核成功', ''], ['颐和美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['梦颜科美', '审核成功', ''], ['都市点点', '审核成功', ''], ['来了美佳澜店', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['木子美甲美睫', '审核成功', ''], ['润妃国际', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如鼻部整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['灵动', '审核成功', ''], ['康丽皇家', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['美丽驿站', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如鼻部整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['美美答伊丽莎', '审核成功', ''], ['匠美JMBEAUTY', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['HB美尚荟', '审核成功', ''], ['Youngface', '审核成功', ''], ['爱睿熙国际', '审核成功', ''], ['当今悦美', '审核成功', ''], ['谦和国际', '审核成功', ''], ['米蝶·快美吧', '审核成功', ''], ['iBEATA贝娅塔', '审核成功', ''], ['菲常美', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['当代经典', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['东方丽人', '审核成功', ''], ['盛士兰', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['玫瑰坊', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['悠兰lyj', '审核失败', '1:小程序内容不符合规则:<br>(1):请在小程序【眼部整形、胸部整形、毛发种植、拉皮】板块服务页面上架正式内容或商品后重新提交审核。\n<br>'], ['芊思雅莎莎', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['来就健康', '审核成功', ''], ['恒美世纪', '审核成功', ''], ['美人记Beauty', '审核成功', ''], ['珺彩秀', '审核成功', ''], ['菲梵经典', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['悦芳泉SPA', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['爱美丽', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['漂亮如你', '审核成功', ''], ['广西宝宝爱', '审核成功', ''], ['虞诗蔓', '审核成功', ''], ['D5 season', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['唯艳美', '审核成功', ''], ['吉美妍丽', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['雪依氏', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['书白美企', '审核失败', '1:小程序内容不符合规则:<br>(1):你好，小程序【预约】页面无具体运营内容，请上架正式内容或商品（非测试）后重新提交审核。（测试环境wifi/4G：iphone7， IOS 11.3.1 ，微信7.0.3）<br>'], ['美约会', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['霭伦恩美', '审核成功', ''], ['来美吧', '审核成功', ''], ['伊美朗', '审核成功', ''], ['美美一生', '审核成功', ''], ['佳婳天美', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['兴美源', '审核成功', ''], ['优年轻', '审核成功', ''], ['易康国际', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['美美昭妍', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['佐登妮丝', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['阿星国际', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['娇阑美颜', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['爱女士', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['PS智能美肤', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。或自查代码，确保包括前端展示、小程序代码等整体无问题，再提交代码审核。<br>'], ['艾妍整形', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['珍珍美容会所', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['姿曼美容spa', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):1.你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。2.你好，你的小程序涉及预付卡发行，请补充选择商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['巴黎情缘', '审核成功', ''], ['百合春天', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['梅兰丽人', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['美由心生', '审核成功', ''], ['燕燕尊尚美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['雅致璇肌', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['诗露丽涵', '审核成功', ''], ['蓝蒂蔻', '审核成功', ''], ['东方仕典', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['韩流美甲', '审核成功', ''], ['GOGO宝迪', '审核成功', ''], ['月瘦月美', '审核成功', ''], ['启程金典美业', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['年轻我可以', '审核成功', ''], ['精工皇族', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['明剪一秀', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['丝客富', '审核成功', ''], ['DuDuBeauty', '审核成功', ''], ['琉璃水城', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如美瞳线，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['栢草源', '审核成功', ''], ['杭州东方整形', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['ONI速美', '审核成功', ''], ['YAN健康•美+', '审核成功', ''], ['MMbeauty', '审核成功', ''], ['美共享', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['靓佳人', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['ME智慧美店', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['二院美丽之约', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['紫舟美业', '审核成功', ''], ['南洋beauty', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['阿芙洛蒂', '审核成功', ''], ['来了美标榜店', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['美德福', '审核成功', ''], ['岳灵生发', '审核成功', ''], ['美姿源', '审核成功', ''], ['雅典娜', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['杭州桐雅', '审核成功', ''], ['维多丽雅', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):1、你好，贵方小程序涉及多个商家提供商品的在线交易及配送，请补充选择电商平台类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。\n2、你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['妃香伊丹', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):小程序页面内容涉及预付卡销售服务，需补充商家自营-预付卡销售-发行方类目。请在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['王海棠养生馆', '审核成功', ''], ['祐美祐康', '审核成功', ''], ['张氏纳然姬朵', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['魅力华健', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['圣水伊人', '审核成功', ''], ['窈窕淑女', '审核成功', ''], ['绮莉尔智能美', '审核成功', ''], ['香密雅CIMIA', '审核成功', ''], ['妍雅媛', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['来了美', '审核成功', ''], ['云SPA', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['轻医美', '审核成功', ''], ['世纪春天', '审核成功', ''], ['贵妇人', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['BabyBeauty', '审核成功', ''], ['奇遇', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['来了美韩尚恩', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['纤指百媚', '审核成功', ''], ['美之颜', '审核成功', ''], ['gobeauty', '审核成功', ''], ['贝琳菲美业', '审核成功', ''], ['郦芙蓉beauty', '审核成功', ''], ['指妃', '审核成功', ''], ['羽梦蝶', '审核成功', ''], ['香住SPA', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['狮子卫士', '审核成功', ''], ['佰味女人', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['黄氏百佳', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及发布医疗广告，请补充选择医疗-医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['创美雅香莱', '审核成功', ''], ['艾面一族 ', '审核成功', ''], ['涣美医疗', '审核失败', '1:服务类目"医疗-私立医疗机构_"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。或自查代码，确保包括前端展示、小程序代码等整体无问题，再提交代码审核。<br>'], ['植美SPA', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['曼姿', '审核成功', ''], ['圣婕美甲美睫', '审核成功', ''], ['美丽九九', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['南国西子', '审核成功', ''], ['百分国际美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['千颂伊美学中心', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如腰椎矫正整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['艾尚美美哒', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如鼻部整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['玉颜堂', '审核成功', ''], ['金美源', '审核成功', ''], ['爱玛仕嘉', '审核成功', ''], ['智能科技美店', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如美瞳线，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['欧妮薇', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['成都净美天使', '审核成功', ''], ['美姿来就美', '审核成功', ''], ['IVY艾菲芭', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['来了美雲会所', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['SoBeauty', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['蒙妮莎新美容', '审核成功', ''], ['筋生美', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['来了美美吧', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['金柏丽', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['长江九号', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如鼻部整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['优文专业脱毛', '审核成功', ''], ['天使国际', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['如生堂', '审核成功', ''], ['梦田芳香Spa', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['贝施纤体', '审核成功', ''], ['色彩纯姬', '审核成功', ''], ['红妆倾城', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['丹阳圣莉斯歌', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['金贵人Beauty', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['芯语芳心', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，如胸部整形，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['广西快来美', '审核成功', ''], ['还原美', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供体检服务，请补充选择医疗-就医服务类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['延颜美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['缘临医疗美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['梦圆皇宫', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['美了就来', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['恩雅', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['董萍智慧美店', '审核成功', ''], ['俏丽屋', '审核成功', ''], ['YoungDream', '审核成功', ''], ['DR美研博士', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['女秀才', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['東美人儿', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['承昱医疗', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['斓悦庭', '审核成功', ''], ['美迩美', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供医美项目服务，请补充选择医疗-私立医疗机构类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['唯美童妍', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['BV美聚', '审核成功', ''], ['健丽宝美容', '审核成功', ''], ['掌上美管家A', '审核成功', ''], ['博妍集美', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['荷塘韵色', '审核成功', ''], ['雅涛世家', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['双妹美容', '审核成功', ''], ['呈悦医疗', '审核成功', ''], ['来了美千丝美', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['世纪之春', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['女主角美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):小程序页面内容涉及预付卡销售服务，需补充商家自营-预付卡销售-发行方类目。请在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['来了就体验店', '审核成功', ''], ['弘粹堂', '审核成功', ''], ['环球美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['乐聚', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['诗芙侬', '审核成功', ''], ['雅梵GOGO', '审核成功', ''], ['沧州美美达', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['妮娜国际', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['赢美肌', '审核成功', ''], ['馨境堂', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['良沐健康管理', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['果蔬美容', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，你的小程序涉及预付卡销售（疗程卡、充值卡等购买充值功能），请补充选择商家自营-商家自营-预付卡销售-预付卡代售类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['贝兰思', '审核成功', ''], ['东方秀丽', '审核成功', ''], ['缔罗嘉佳', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):1.你好，你的小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。2.你好，你的小程序涉及预付卡内容，请补充选择【商家自营-预付卡销售-发行方】类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>'], ['文轩专业美容', '审核成功', ''], ['欧丽薇', '审核失败', '1:服务类目"生活服务-丽人_美容"与你提交代码审核时设置的功能页面内容不一致:<br>(1):你好，贵方小程序涉及提供洗浴保健服务，请补充选择生活服务-洗浴保健类目，并在基础信息处申请该类目，通过资质审核并在配置功能页添加符合该类目的功能页面。<br>']]
# # import pandas as pd
# # data = pd.read_excel('xcxs.xls')
# # data['序号'] = [i for i in range(len(a))]
# # data['小程序名称'] = [i[0] for i in a]
# # data['审核状态'] = [i[1] for i in a]
# # data['审核失败原因'] = [i[2] for i in a]
# # data.to_excel('xcxs.xls')
# #
# # import pandas as pd
# # import numpy as np
# # from pandas import DataFrame
# #
# # data = pd.read_excel('./xcx.xls')
# # print(data)
# #
# # data1 = list(data['小程序名称'].values)
# #
# # data2 = list(data['成功的程序'].values)
# # s = []
# # for i in data1:
# #     if i in data2:
# #         i = str(i)+'after'
# #         s.append(i)
# #     else:
# #         s.append(i)
# # df = DataFrame(columns=['a'], data=s)
# # data['成功的记录'] = df['a']
# # print(data)
# # data.to_excel('result.xls')
#
# import time
# # a = time.time()
# # print(int(a) * 1000)
# import sys,requests
# def wocao():
#     print(type(sys._getframe().f_code.co_name))
# wocao()
#
# data = {"cMerchantId":81136,"pageIndex":1,"customerId":263389,"terminal":"xcx","appCode":29,"terminal_interface_type":"MiniProgram","login_token":"8fd6bd34-e44e-41f0-87ad-3f1ffa51b0e8","login_merchant_id":81136}
#
# r = requests.post('https://ggbxcwx.ydm01.cn/api/ydm_xc_new/listBookingOrder',
#                   json=data,
#                    )
# response = [x['orderState'] for x in r.json()['data']]
# s = []
# a = {0:'未预约' ,1:'待支付' ,2:'已取消' ,3:'已消费' ,4:'预约中' ,5:'预约成功（待服务）',6:'预约成功（服务中）' ,7:'服务完成' ,8:'转赠中'}
# responses = []
# for i in range(1,20):
#     if i != 0:
#         data['pageIndex'] = i
#         r = requests.post('https://ggbxcwx.ydm01.cn/api/ydm_xc_new/listBookingOrder',
#                           json=data,
#                           )
#         print(r.json())
#         response = [x['orderState'] for x in r.json()['data']]
#         responses.append(response)
#
# print(responses)
# for i in responses:
#     for i in response:
#         s.append(a[i])
# print(s,len(s))

#
# import requests
# data = {"pageNumber":1,"pageData":2000,"SbookingTime":"","SLongTime":"","SorderReceiver":"","SpayState":"","SbookingState":"","deadLineCondition":"","order_source":"","orderStatus":3,"operateType":1}
#
# url = 'https://saas.ydm01.cn/api/order_manage/ManagerStoreOrderAll_v2'
# header = {
#     'Authorization':'Bearer fa62d224-9331-47de-914d-fc87b46fede9'
# }
# r  =requests.post(url,data,headers=header)
# order_id = [i['serialNumber'] for i in r.json()['data']]
# print(order_id,len(order_id))
#
# urls = 'https://saas.ydm01.cn/api/order_manage/ManagerStoreOrderAll_v2'
# datas = {"pageNumber":1,"pageData":10,"searchParam":"serialNumber","Stime":"","SLongTime":"","SorderReceiver":"","SpayState":"","SbookingState":"","deadLineCondition":"","order_source":"","orderStatus":11,"operateType":1}
# for i in order_id:
#     datas['searchParam'] = i
#     r = requests.post(urls,data=datas,headers =header)
#     if r.json()['data'].__len__() == 0:
#         print (i)

# a = {}
# a['s'] = ''
# print (a)
#
#
#
#
# URL='https://ggbxcwx.ydm01.cn/api/ydm_xc_new/listUnbookedOrderType'
# data = {
#     'appCode':40,
#     'pageIndex':1
# }
# h = {
#     "authorization":'Bearer 17560501-a1ed-44aa-b2c8-c7ac1a2d40e9'
# }
# import requests
# r = requests.post(url=URL,json=data,headers=h)
# print (r.json())







def read_txt():
    with open('parme.txt','r') as p:
        p.read()
print(read_txt())